<?php

return [
    'errors' => [
        'title' => 'មានកំហុសចំនួន :count ក្នុងការផ្ទៀងផ្ទាត់៖',
    ],

    'select' => [
        'default' => 'ជ្រើសរើសជម្រើសមួយ',
        'search' => 'ស្វែងរកអ្វីមួយនៅទីនេះ',
        'empty' => 'រកមិនឃើញលទ្ធផលទេ',
    ],

    'toast' => [
        'button' => [
            'ok' => 'យល់ព្រម',
            'confirm' => 'បញ្ជាក់',
            'cancel' => 'បោះបង់',
        ],
    ],

    'dialog' => [
        'button' => [
            'ok' => 'យល់ព្រម',
            'confirm' => 'បញ្ជាក់',
            'cancel' => 'បោះបង់',
        ],
    ],

    'table' => [
        'empty' => 'រកមិនឃើញលទ្ធផលទេ។',
        'quantity' => 'បរិមាណ',
        'search' => 'ស្វែងរកអ្វីមួយនៅទីនេះ',
    ],

    'clipboard' => [
        'button' => [
            'copy' => 'ចម្លង',
            'copied' => 'បានចម្លង!',
        ],
    ],

    'password' => [
        'rules' => [
            'title' => 'ទម្រង់ពាក្យសម្រាប់ពាក្យសម្ងាត់ដោយចង់:',
            'formats' => [
                'min' => 'យ៉ាងហោចណាស់ :min តួអក្សរ',
                'numbers' => 'យ៉ាងហោចណាស់លេខមួយ',
                'symbols' => 'យ៉ាងហោចណាស់នូវនិមិត្តសញ្ញានៃនិកសម្ពន្ធ (:symbols)',
                'mixed' => 'យ៉ាងហោចណាស់តួអក្សរធំមួយ',
            ],
        ],
    ],

    'upload' => [
        'placeholder' => 'ជ្រើសរើសឯកសារ',
        'size' => 'ទំហំ',
        'upload' => 'ចុច​ទី​នេះ​ដើម្បី​ផ្ទុក​ឡើង',
        'uploaded' => [
            'single' => ':count ឯកសារ​បាន​ផ្ទុក​ឡើង',
            'multiple' => ':count ឯកសារ​បាន​ផ្ទុក​ឡើង',
        ],
        'error' => 'មាន​កំហុស​ហើយ។ សូម​ព្យាយាម​ម្តង​ទៀត។',
    ],
];
