<?php

return [
    'errors' => [
        'title' => 'មានកំហុសចំនួន :count ក្នុងការផ្ទៀងផ្ទាត់៖',
    ],

    'select' => [
        'default' => 'ជ្រើសរើសជម្រើសមួយ',
        'search' => 'ស្វែងរកអ្វីមួយនៅទីនេះ',
        'empty' => 'រកមិនឃើញលទ្ធផលទេ',
    ],

    'toast' => [
        'button' => [
            'ok' => 'យល់ព្រម',
            'confirm' => 'បញ្ជាក់',
            'cancel' => 'បោះបង់',
        ],
    ],

    'dialog' => [
        'button' => [
            'ok' => 'យល់ព្រម',
            'confirm' => 'បញ្ជាក់',
            'cancel' => 'បោះបង់',
        ],
    ],

    'table' => [
        'empty' => 'រកមិនឃើញលទ្ធផលទេ។',
        'quantity' => 'បរិមាណ',
        'search' => 'ស្វែងរកអ្វីមួយនៅទីនេះ',
    ],
];
