<?php

return [
    'errors' => [
        'title' => 'មានកំហុសចំនួន :count ក្នុងការផ្ទៀងផ្ទាត់៖',
    ],

    'select' => [
        'default' => 'ជ្រើសរើសជម្រើសមួយ',
        'search' => 'ស្វែងរកអ្វីមួយនៅទីនេះ',
        'empty' => 'រកមិនឃើញលទ្ធផលទេ',
    ],

    'toast' => [
        'button' => [
            'ok' => 'យល់ព្រម',
            'confirm' => 'បញ្ជាក់',
            'cancel' => 'បោះបង់',
        ],
    ],

    'dialog' => [
        'button' => [
            'ok' => 'យល់ព្រម',
            'confirm' => 'បញ្ជាក់',
            'cancel' => 'បោះបង់',
        ],
    ],

    'table' => [
        'empty' => 'រកមិនឃើញលទ្ធផលទេ។',
        'quantity' => 'បរិមាណ',
        'search' => 'ស្វែងរកអ្វីមួយនៅទីនេះ',
    ],

    'clipboard' => [
        'button' => [
            'copy' => 'ចម្លង',
            'copied' => 'បានចម្លង!',
        ],
    ],

    'password' => [
        'rules' => [
            'title' => 'ទម្រង់ពាក្យសម្រាប់ពាក្យសម្ងាត់ដោយចង់:',
            'formats' => [
                'min' => 'យ៉ាងហោចណាស់ :min តួអក្សរ',
                'numbers' => 'យ៉ាងហោចណាស់លេខមួយ',
                'symbols' => 'យ៉ាងហោចណាស់នូវនិមិត្តសញ្ញានៃនិកសម្ពន្ធ (:symbols)',
                'mixed' => 'យ៉ាងហោចណាស់តួអក្សរធំមួយ',
            ],
        ],
    ],

    'upload' => [
        'placeholder' => 'ជ្រើសរើសឯកសារ',
        'size' => 'ទំហំ',
        'upload' => 'ចុចទីនេះដើម្បីផ្ទុកឡើង',
        'uploaded' => [
            'single' => 'ឯកសារ :count ឯកសារបានផ្ទុកឡើង',
            'multiple' => 'ឯកសារ :count ឯកសារបានផ្ទុកឡើង',
        ],
        'error' => 'មានអ្វីមិនប្រក្រតី។ សូមព្យាយាមម្តងទៀត។',
        'static' => [
            'empty' => [
                'title' => 'គ្មានរូបភាព។',
                'description' => 'អ្នកមិនទាន់មានរូបភាពទេ។',
            ],
        ],
    ],

    'timepicker' => [
        'helper' => 'ម៉ោងបច្ចុប្បន្ន',
    ],

    // TODO: datepicker

    'step' => [
        'next' => 'បន្តបន្ទាប់',
        'previous' => 'មុន',
        'finish' => 'បញ្ចប់',
    ],
];
